In [1]:
import pandas as pd
import os

In [2]:
# Arquivos na pasta Datasets
base = './../../Datasets/'
arquivos = [arquivo for arquivo in os.listdir(base)]

arquivos

['populacao_brasileira.csv',
 'german_credit_data.csv',
 'dataset_valores.txt',
 'diamonds.csv',
 'NAs.txt',
 '2010SitkaAK.csv',
 '2018WinterOlympics.csv',
 'Exercicio_Pandas_3.csv',
 'Iris.csv',
 'dataset_array.txt',
 '2010YumaAZ.csv',
 'bmw_pricing_challenge.csv',
 'heart.csv',
 'Exercicio_Pandas_2.json',
 'BankChurners.csv',
 '2010SantaBarbaraCA.csv',
 'dataset_valores_vazio.txt',
 'Exercicio_Pandas_1.csv',
 'dataset_desconfigurado.txt',
 'kc_house_data.csv',
 'cars.csv']

In [3]:
populacao = pd.read_csv(f'{base}/{arquivos[0]}', sep=';')
display(populacao.shape, populacao.head())

(37, 2)

   year  population
0  1980   119011052
1  1981   121154159
2  1982   123774229
3  1983   126403352
4  1984   129025577

In [4]:
credit = pd.read_csv(f'{base}/{arquivos[1]}')
display(arquivos[1], credit.shape, credit.head())

'german_credit_data.csv'

(1000, 10)

,Unnamed: 0,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,0,67,male,2,own,NaN,little,1169,6,radio/TV
1,1,22,female,2,own,little,moderate,5951,48,radio/TV
2,2,49,male,1,own,little,NaN,2096,12,education
3,3,45,male,2,free,little,little,7882,42,furniture/equipment
4,4,53,male,2,free,little,little,4870,24,car

In [5]:
valores = pd.read_fwf(f'{base}/{arquivos[2]}', widths=[8, 8, 8])
valores.columns = ['A', 'B', 'C']

display(arquivos[2], valores.shape, valores.head())

'dataset_valores.txt'

(5, 3)

        A       B       C
0  0.4839  0.4536  0.3561
1  0.1292  0.6875  0.6565
2  0.1781  0.3049  0.8928
3  0.7676  0.5801  0.2038
4  0.5993  0.4357  0.7410

In [6]:
# NAs
nas = pd.read_csv(f'{base}/{arquivos[4]}', sep='\t')
nas = nas.iloc[:,1:]
display(arquivos[4], nas.shape, nas.head())

'NAs.txt'

(10, 3)

          A         B         C
0 -0.166919  0.979728 -0.632955
1 -0.297953 -0.912674 -1.365463
2 -0.120211 -0.540679 -0.680481
3       NaN -2.027325  1.533582
4       NaN       NaN  0.461821

In [7]:
# Arquivos que começam com 2010 e são iguais
for arquivo in arquivos:
    if arquivo.startswith('2010'):
        df = pd.read_csv(f'{base}/{arquivo}')
        display(arquivo, df.shape, df.head())

'2010SitkaAK.csv'

(168, 4)

   LST_DATE      DAY LST_TIME  T_HR_AVG
0  20100601  TUESDAY     0:00      10.5
1  20100601  TUESDAY     1:00      10.5
2  20100601  TUESDAY     2:00      10.0
3  20100601  TUESDAY     3:00       9.7
4  20100601  TUESDAY     4:00       9.4

'2010YumaAZ.csv'

(168, 4)

   LST_DATE      DAY LST_TIME  T_HR_AVG
0  20100601  TUESDAY     0:00      25.2
1  20100601  TUESDAY     1:00      24.1
2  20100601  TUESDAY     2:00      24.4
3  20100601  TUESDAY     3:00      24.9
4  20100601  TUESDAY     4:00      22.8

'2010SantaBarbaraCA.csv'

(168, 4)

   LST_DATE      DAY LST_TIME  T_HR_AVG
0  20100601  TUESDAY     0:00      12.7
1  20100601  TUESDAY     1:00      12.7
2  20100601  TUESDAY     2:00      12.3
3  20100601  TUESDAY     3:00      12.5
4  20100601  TUESDAY     4:00      12.7

In [8]:
# Olympics
olympics = pd.read_csv(f'{base}/{arquivos[6]}')
display(arquivos[6], olympics.shape, olympics.head())

'2018WinterOlympics.csv'

(30, 6)

   Rank            NOC  Gold  Silver  Bronze  Total
0     1         Norway    14      14      11     39
1     2        Germany    14      10       7     31
2     3         Canada    11       8      10     29
3     4  United States     9       8       6     23
4     5    Netherlands     8       6       6     20

In [16]:
produtos_01 = pd.read_csv(f'{base}/{arquivos[7]}', sep='\t')
display(arquivo, produtos_01.shape, produtos_01.head())

'cars.csv'

(2, 4)

   Produto  Quantidade_Vendida  Valor_Unitario  Valor_Total
0    Mouse                  60              50         3000
1  Teclado                  40             100         4000

In [18]:
iris = pd.read_csv(f'{base}/{arquivos[8]}')
display(arquivos[8], iris.shape, iris.head())

'Iris.csv'

(150, 6)

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [26]:
data = pd.read_csv(f'{base}/{arquivos[9]}', header=None)
display(arquivos[9], data.shape, data.head(), data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       6 non-null      float64
dtypes: float64(1)
memory usage: 176.0 bytes

'dataset_array.txt'

(6, 1)

     0
0  1.0
1  2.0
2  3.0
3  4.0
4  5.0

None

In [33]:
bmw_pricing_challenge = pd.read_csv(f'{base}/{arquivos[11]}')
display(arquivos[11], bmw_pricing_challenge.shape, bmw_pricing_challenge.head())

'bmw_pricing_challenge.csv'

(4843, 18)

,maker_key,model_key,mileage,engine_power,registration_date,fuel,paint_color,car_type,feature_1,feature_2,feature_3,feature_4,feature_5,feature_6,feature_7,feature_8,price,sold_at
0,BMW,118,140411,100,2012-02-01,diesel,black,convertible,True,True,False,False,True,True,True,False,11300,2018-01-01
1,BMW,M4,13929,317,2016-04-01,petrol,grey,convertible,True,True,False,False,False,True,True,True,69700,2018-02-01
2,BMW,320,183297,120,2012-04-01,diesel,white,convertible,False,False,False,False,True,False,True,False,10200,2018-02-01
3,BMW,420,128035,135,2014-07-01,diesel,red,convertible,True,True,False,False,True,True,True,True,25100,2018-02-01
4,BMW,425,97097,160,2014-12-01,diesel,silver,convertible,True,True,False,False,False,True,True,True,33400,2018-04-01

In [34]:
arquivos[12]

'heart.csv'

In [24]:
headers = ['     ', 'A       ', 'B    ', 'C']
widths = [len(head) for head in headers]

data = pd.read_fwf(f'{base}/{arquivos[9]}', widths=widths, header=None)
data.columns = ['ID', 'A', 'B', 'C']
# data['B'].astype('float64')
display(arquivos[9], data.shape, data.head(), data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      6 non-null      float64
 1   A       6 non-null      int64
 2   B       6 non-null      int64
 3   C       6 non-null      int64
dtypes: float64(1), int64(3)
memory usage: 320.0 bytes

'dataset_array.txt'

(6, 4)

    ID  A  B  C
0  1.0  0  0  0
1  2.0  0  0  0
2  3.0  0  0  0
3  4.0  0  0  0
4  5.0  0  0  0

None

In [10]:
data = pd.read_csv('./../../Datasets/diamonds.csv')
data.head()

,Unnamed: 0,carat,cut,color,clarity,depth,table,price,x,y,z
0,1,0.23,Ideal,E,SI2,61.5,55.0,326,3.95,3.98,2.43
1,2,0.21,Premium,E,SI1,59.8,61.0,326,3.89,3.84,2.31
2,3,0.23,Good,E,VS1,56.9,65.0,327,4.05,4.07,2.31
3,4,0.29,Premium,I,VS2,62.4,58.0,334,4.20,4.23,2.63
4,5,0.31,Good,J,SI2,63.3,58.0,335,4.34,4.35,2.75